{"head":{"title":"Serverless Framework - AWS Lambda Guide - Deploying","menuText":"Deploying","menuOrder":8,"description":"How to deploy your AWS Lambda functions and their required infrastructure","layout":"Page"},"body":"<!-- DOCS-SITE-LINK:START automatically generated  -->\n### [Read this on the main serverless docs site](https://www.serverless.com/framework/docs/providers/aws/guide/deploying)\n<!-- DOCS-SITE-LINK:END -->\n<h1 id=\"deploying\"><a href=\"#deploying\" class=\"phenomic-HeadingAnchor\">#</a>Deploying</h1>\n<p>The Serverless Framework was designed to provision your AWS Lambda Functions, Events and infrastructure Resources safely and quickly.  It does this via a couple of methods designed for different types of deployments.</p>\n<h2 id=\"deploy-all\"><a href=\"#deploy-all\" class=\"phenomic-HeadingAnchor\">#</a>Deploy All</h2>\n<p>This is the main method for doing deployments with the Serverless Framework:</p>\n<pre><code class=\"hljs language-bash\">serverless deploy</code></pre>\n<p>Use this method when you have updated your Function, Event or Resource configuration in <code>serverless.yml</code> and you want to deploy that change (or multiple changes at the same time) to Amazon Web Services.</p>\n<h3 id=\"how-it-works\"><a href=\"#how-it-works\" class=\"phenomic-HeadingAnchor\">#</a>How It Works</h3>\n<p>The Serverless Framework translates all syntax in <code>serverless.yml</code> to a single AWS CloudFormation template.  By depending on CloudFormation for deployments, users of the Serverless Framework get the safety and reliability of CloudFormation.</p>\n<ul>\n<li>An AWS CloudFormation template is created from your <code>serverless.yml</code>.</li>\n<li>If a Stack has not yet been created, then it is created with no resources except for an S3 Bucket, which will store zip files of your Function code.</li>\n<li>The code of your Functions is then packaged into zip files.</li>\n<li>Zip files of your Functions' code are uploaded to your Code S3 Bucket.</li>\n<li>Any IAM Roles, Functions, Events and Resources are added to the AWS CloudFormation template.</li>\n<li>The CloudFormation Stack is updated with the new CloudFormation template.</li>\n</ul>\n<h3 id=\"tips\"><a href=\"#tips\" class=\"phenomic-HeadingAnchor\">#</a>Tips</h3>\n<ul>\n<li>\n<p>Use this in your CI/CD systems, as it is the safest method of deployment.</p>\n</li>\n<li>\n<p>You can print the progress during the deployment if you use <code>verbose</code> mode, like this:</p>\n<pre><code>serverless deploy --verbose\n</code></pre>\n</li>\n<li>\n<p>This method uses the AWS CloudFormation Stack Update method.  CloudFormation is slow, so this method is slower.  If you want to develop more quickly, use the <code>serverless deploy function</code> command (described below)</p>\n</li>\n<li>\n<p>This method defaults to <code>dev</code> stage and <code>us-east-1</code> region.  You can change the default stage and region in your <code>serverless.yml</code> file by setting the <code>stage</code> and <code>region</code> properties inside a <code>provider</code> object as the following example shows:</p>\n<pre><code class=\"hljs language-yml\"><span class=\"hljs-comment\"># serverless.yml</span>\n\n<span class=\"hljs-attr\">service:</span> service-name\n<span class=\"hljs-attr\">provider:</span>\n<span class=\"hljs-attr\">  name:</span> aws\n<span class=\"hljs-attr\">  stage:</span> beta\n<span class=\"hljs-attr\">  region:</span> us-west<span class=\"hljs-bullet\">-2</span></code></pre>\n</li>\n<li>\n<p>You can also deploy to different stages and regions by passing in flags to the command:</p>\n<pre><code>serverless deploy --stage production --region eu-central-1\n</code></pre>\n</li>\n</ul>\n<p>Check out the <a href=\"../cli-reference/deploy\">deploy command docs</a> for all details and options.</p>\n<h2 id=\"deploy-function\"><a href=\"#deploy-function\" class=\"phenomic-HeadingAnchor\">#</a>Deploy Function</h2>\n<p>This deployment method does not touch your AWS CloudFormation Stack.  Instead, it simply overwrites the zip file of the current function on AWS.  This method is much faster, since it does not rely on CloudFormation.</p>\n<pre><code class=\"hljs language-bash\">serverless deploy <span class=\"hljs-keyword\">function</span> --function myFunction</code></pre>\n<h3 id=\"how-it-works-1\"><a href=\"#how-it-works-1\" class=\"phenomic-HeadingAnchor\">#</a>How It Works</h3>\n<ul>\n<li>The Framework packages up the targeted AWS Lambda Function into a zip file.</li>\n<li>That zip file is uplaoded to your S3 bucket using the same name as the previous function, which the CloudFormation stack is pointing to.</li>\n</ul>\n<h3 id=\"tips-1\"><a href=\"#tips-1\" class=\"phenomic-HeadingAnchor\">#</a>Tips</h3>\n<ul>\n<li>Use this when you are developing and want to test on AWS because it's much faster.</li>\n<li>During development, people will often run this command several times, as opposed to <code>serverless deploy</code> which is only run when larger infrastructure provisioning is required.</li>\n</ul>\n<p>Check out the <a href=\"../cli-reference/deploy.md\">deploy command docs</a> for all details and options.</p>\n","__filename":"providers\\aws\\guide\\deploying.md","__url":"/providers/aws/guide/deploying/","__resourceUrl":"/providers/aws/guide/deploying/index.html","__dataUrl":"/providers/aws/guide/deploying/index.html.1315d2246fe07465f5ebb145e8c08191.json"}